#define _CRT_SECURE_NO_WARNINGS
#include<stdio.h>
// 逻辑运算符 &&表示并且 两个条件都要满足 两个都满足为1 有其中一个不满足或者两个都不满足则为0
//  || 表示或者 两个之中其中一个满足即可至少一个满足为1 两个都不满足为0
// 逻辑非 ！真变假 假变真 比如！（3>1) 结果就是0
//  赋值== 把某个数值赋给某个变量
// 复合赋值 +=  比如a+=2 即为a=a+2 -=  *= /=  %=同理
// 自增自减 a++ 即a=a+1 a--同理  注意！没有乘和除 ++a和--a a++是先赋值给别人再加一 ++a是先加一再赋值给别人
//int main()
//{
//	int a = 1;
//	int b = (a++) + (++a);
//	printf("%d %d", b, a);
//	return 0;
//}    结果b=4 a=3  嗯嗯 我明白
//三目运算符 a?b:c 判断a是否为真真的话就输出b 假就输出c 在输出两个数中的最大值时比较方便
// 两边的类型必须一样 是可以互相转化的 字符可以是数字 int可以变成double
// if eles 
//int main()
//{
//	int a = 1;
//	if (a >= 3)
//	{
//		printf("123");//当if括号里面的满足即数值为1时 会执行下面打括号里面的内容输出
//	}
//	else if(a<3&&a>=2)
//	{
//		a++;
//		printf("%d", a);
//	}
//	else
//	{
//		printf("a<2");
//	}
//	return 0;
//}
//int main()
//{
//	int a=1;
//	switch (a)//switch里面常见放的是变量
//	{
//		case 1://case后面只能放数值确定的整数 字符也可以 因为有对应的整数ASCII值 
//			printf("YES");
//			break;
//		case 4:
//			break;
//		default://这个最好加上
//			break;
//	}
//	return 0;
//}
// 位运算符 按位与&  二进制语言 比较两个或多个数字二进制在相同位数中同是1则1 有一个是0则0 
// 用来判断数字的奇偶性 与1进行按位与 就行  ；提取位数值；合并权限（这个还不知道啥意思）
//按位或 |  有一个是1就是1 全都是0才是0
//按位异或  不同是1 相同是0  A^B^B=A用来加密解密
//>>右移  <<左移 口诀数字整体向左或右移动 剩下的位置补0 3<<2 是1100=12
//int main()   输一个整数判断大于小于等于0
//{
//	int a;
//	scanf("%d", &a);
//	if (a > 0)
//	{
//		printf("正数");
//	}
//	else if (a == 0)
//	{
//		printf("0");
//	}
//	else
//	{
//		printf("负数");
//	}
//	return 0;
//}
//int main()   判断奇偶性  直接除以二看余数是1还是2（平时用这个）我问千问的这个方法太炫技了
//{
//	int a;
//	scanf("%d", &a);
//	if (a & 1 == 1)
//	{
//		printf("奇数");
//	}
//	else
//	{
//		printf("偶数");
//	}
//	return 0;
//}
//int main()
//{
//	int a;
//	scanf("%d", &a);
//	if (a % 2 == 0)   这里直接写成a%2 更好因为这里结果就是0或1 假或真
//	{
//		printf("偶数");
//	}
//	else
//	{
//		printf("奇数");
//	}
//	return 0;
//}
int main()
{

	return 0;
}